Revit 2027 API
Connector.Coefficient Property
 The coefficient of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Coefficient { get; }
Public ReadOnly Property Coefficient As Double
	Get
public:
property double Coefficient {
	double get ();
}
member Coefficient : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This connector does not support flow calculation and associated properties.
Remarks
 Instantaneous coefficient of this connector, calculated according to system.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace